🚀&nbsp; env0 had composed a PR Plan for environment [ecs-pipelines-82562](https://app.env0.com/p/748f210a-9789-4a9b-a7b9-388a4181ef02/environments/3003e123-de93-419a-b5b8-7db0a08a7a85):
  ```
Plan: 59 to add, 0 to change, 0 to destroy.
```
  <details>
<summary>Plan Details</summary>

```
> /opt/tfenv/bin/terraform plan -out=.tf-plan -lock=false
Refreshing Terraform state in-memory prior to plan...

The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


data.aws_iam_policy_document.codepipeline_assume: Refreshing state...

data.aws_caller_identity.current: Refreshing state...

data.aws_iam_policy_document.ecs_assume: Refreshing state...
data.aws_iam_policy_document.ecs_fargate: Refreshing state...
data.aws_iam_policy_document.codebuild_policy: Refreshing state...
data.aws_iam_policy_document.ecs_fargate_permissions: Refreshing state...

data.aws_region.current: Refreshing state...
data.aws_iam_policy_document.codepipeline_policy: Refreshing state...

data.template_file.buildspec: Refreshing state...


------------------------------------------------------------------------


An execution plan has been generated and is shown below.

Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.helloworld_fargate will be created
  + resource "aws_cloudwatch_log_group" "helloworld_fargate" {
      + arn               = (known after apply)

      + id                = (known after apply)
      + name              = "helloworld-fargate"
      + retention_in_days = 0
    }

  # aws_cloudwatch_log_stream.helloworld_fargate will be created
  + resource "aws_cloudwatch_log_stream" "helloworld_fargate" {

      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "helloworld-fargate"
      + name           = "helloworld-fargate"
    }


  # aws_codebuild_project.app_build will be created
  + resource "aws_codebuild_project" "app_build" {
      + arn            = (known after apply)
      + badge_enabled  = false
      + badge_url      = (known after apply)

      + build_timeout  = 10
      + description    = (known after apply)
      + encryption_key = (known after apply)
      + id             = (known after apply)
      + name           = "helloworld-codebuild"

      + queued_timeout = 480
      + service_role   = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + environment {

          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0"
          + image_pull_credentials_type = "CODEBUILD"

          + privileged_mode             = true
          + type                        = "LINUX_CONTAINER"
        }

      + source {
          + buildspec = <<~EOT
                version: 0.2
                
                phases:

                  install:
                    runtime-versions:
                        docker: 18
                  pre_build:
                    commands:
                      - pip install awscli --upgrade --user
                      - echo `aws --version`
                      - echo Logging in to ECR...
                      - $(aws ecr get-login --region eu-west-1 --no-include-email)
                      - REPOSITORY_URI=944734919875.dkr.ecr.eu-west-1.amazonaws.com/steamhaus-lab/helloworld
                      - APPLICATION_NAME=helloworld
                      - echo Configured pre-build environment
                  build:
                    commands:
                      - echo Build started on `date`
                      - echo Building the image...
                      - docker build -t steamhaus-lab/$APPLICATION_NAME .
                      - docker tag steamhaus-lab/$APPLICATION_NAME:latest $REPOSITORY_URI:latest
                  post_build:
                    commands:
                      - echo Build completed on `date`
                      - echo Pushing the Docker images...
                      - docker push $REPOSITORY_URI:latest
                      - echo Writing image definitions file...
                      - printf '[{"name":"%s","imageUri":"%s"}]' $APPLICATION_NAME $REPOSITORY_URI:latest > imagedefinitions.json
                artifacts:
                  files: imagedefinitions.json
            EOT
          + type      = "CODEPIPELINE"
        }
    }

  # aws_codepipeline.helloworld_pipeline will be created
  + resource "aws_codepipeline" "helloworld_pipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "helloworld-pipeline"
      + role_arn = (known after apply)

      + artifact_store {
          + location = "steamhaus-env0-test"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "Branch"               = "master"
                  + "OAuthToken"           = "*************"

                  + "Owner"                = "pauljflo"

                  + "PollForSourceChanges" = "true"
                  + "Repo"                 = "node-hello"
                }
              + name             = "Source"
              + output_artifacts = [
                  + "workspace",
                ]
              + owner            = "ThirdParty"
              + provider         = "GitHub"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"


          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "helloworld-codebuild"
                }
              + input_artifacts  = [
                  + "workspace",
                ]
              + name             = "Build"
              + output_artifacts = [
                  + "imagedefs",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Approval"

          + action {
              + category  = "Approval"

              + name      = "Approval"
              + owner     = "AWS"
              + provider  = "Manual"
              + region    = (known after apply)
              + run_order = (known after apply)
              + version   = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ClusterName" = "steamhaus-lab"
                  + "FileName"    = "imagedefinitions.json"
                  + "ServiceName" = "helloworld-fargate"
                }
              + input_artifacts = [
                  + "imagedefs",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "ECS"

              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "steamhaus-lab/helloworld"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.ecs will be created
  + resource "aws_ecs_cluster" "ecs" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "steamhaus-lab"

      + setting {
          + name  = (known after apply)

          + value = (known after apply)
        }
    }


  # aws_ecs_service.helloworld_fargate will be created
  + resource "aws_ecs_service" "helloworld_fargate" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100

      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)

      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "helloworld-fargate"
      + platform_version                   = (known after apply)

      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "helloworld"
          + container_port   = 80

          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.helloworld will be created
  + resource "aws_ecs_task_definition" "helloworld" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(

            [
              + {
                  + environment      = [
                      + {
                          + name  = "APP_ENV"
                          + value = "dev"
                        },
                    ]
                  + image            = "pauljflo/demo-app:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "helloworld-fargate"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "helloworld-fargate"
                        }

                    }
                  + name             = "helloworld"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "helloworld-fargate"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + task_role_arn            = (known after apply)

      + volume {
          + name = "tmp_storage"
        }
    }


  # aws_iam_instance_profile.helloworld will be created
  + resource "aws_iam_instance_profile" "helloworld" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "helloworld"
      + path        = "/"
      + role        = "helloworld"
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.codebuild_policy will be created
  + resource "aws_iam_policy" "codebuild_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)

      + name   = "codebuild"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:PutParameter",
                          + "ssm:GetParameter",
                          + "ssm:DeleteParameter",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "iam:PassRole",
                          + "ecs:RunTask",
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"

                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:List*",
                          + "s3:GetObjectVersion",

                          + "s3:GetObject",

                          + "s3:GetBucketVersioning",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"

                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.codepipeline_policy will be created
  + resource "aws_iam_policy" "codepipeline_policy" {
      + arn    = (known after apply)

      + id     = (known after apply)
      + name   = "codepipeline"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",

                          + "s3:List*",
                          + "s3:GetObjectVersion",
                          + "s3:GetObject",
                          + "s3:GetBucketVersioning",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },

                  + {
                      + Action   = [
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetBuilds",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {

                      + Action   = [
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogGroup",
                          + "iam:ListRoles",
                          + "iam:ListInstanceProfiles",

                          + "iam:ListAttachedRolePolicies",
                          + "events:RemoveTargets",
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:ListTargetsByRule",
                          + "events:ListRuleNamesByTarget",

                          + "events:DescribeRule",
                          + "events:DeleteRule",
                          + "ecs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {

                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringLike = {
                              + iam:PassedToService = "ecs-tasks.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"

                      + Sid       = ""
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringLike = {
                              + iam:PassedToService = [
                                  + "ec2.amazonaws.com.cn",
                                  + "ec2.amazonaws.com",
                                ]
                            }
                        }

                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::*:role/ecsInstanceRole*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {

                          + StringLike = {
                              + iam:PassedToService = [
                                  + "application-autoscaling.amazonaws.com.cn",
                                  + "application-autoscaling.amazonaws.com",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::*:role/ecsAutoscaleRole*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringLike = {
                              + iam:AWSServiceName = [
                                  + "spotfleet.amazonaws.com",
                                  + "spot.amazonaws.com",
                                  + "ecs.amazonaws.com",
                                ]

                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.ecs_fargate will be created

  + resource "aws_iam_policy" "ecs_fargate" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "ecs-fargate"
      + path   = "/"
      + policy = jsonencode(
            {

              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",

                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"

            }
        )
    }

  # aws_iam_policy.ecs_fargate_permissions will be created
  + resource "aws_iam_policy" "ecs_fargate_permissions" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "ecs-fargate-permissions"

      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEventsBatch",
                          + "logs:PutLogEvents",

                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.codebuild_role will be created

  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"

                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "codepipeline.amazonaws.com",
                              + "codebuild.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]

              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600

      + name                  = "codebuild"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)

      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [

                              + "codepipeline.amazonaws.com",
                              + "codebuild.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )

      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline"
      + path                  = "/"

      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_fargate will be created
  + resource "aws_iam_role" "ecs_fargate" {
      + arn                   = (known after apply)

      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"

                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "logs.amazonaws.com",
                              + "ecs.amazonaws.com",

                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)

      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-fargate"
      + path                  = "/"

      + unique_id             = (known after apply)
    }

  # aws_iam_role.helloworld will be created
  + resource "aws_iam_role" "helloworld" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {

                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "logs.amazonaws.com",
                              + "ecs.amazonaws.com",

                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false

      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "helloworld"
      + path                  = "/"
      + unique_id             = (known after apply)
    }


  # aws_iam_role_policy_attachment.codebuild_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codebuild_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "codebuild"
    }


  # aws_iam_role_policy_attachment.codepipeline_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codepipeline_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "codepipeline"
    }


  # aws_iam_role_policy_attachment.ecs_fargate will be created
  + resource "aws_iam_role_policy_attachment" "ecs_fargate" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-fargate"
    }


  # aws_iam_role_policy_attachment.helloworld_permissions will be created
  + resource "aws_iam_role_policy_attachment" "helloworld_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "helloworld"
    }

  # aws_lb.app will be created

  + resource "aws_lb" "app" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false

      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)

      + load_balancer_type         = "application"
      + name                       = "helloworld"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)

      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)

          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.app will be created
  + resource "aws_lb_listener" "app" {
      + arn               = (known after apply)
      + id                = (known after apply)

      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)

          + type             = "forward"
        }
    }

  # aws_lb_target_group.helloworld will be created
  + resource "aws_lb_target_group" "helloworld" {

      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 120
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false

      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "helloworld"
      + port                               = 80
      + protocol                           = "HTTP"

      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)

          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)

          + path                = (known after apply)

          + port                = (known after apply)
          + protocol            = (known after apply)

          + timeout             = (known after apply)

          + unhealthy_threshold = (known after apply)
        }

      + stickiness {

          + cookie_duration = (known after apply)
          + enabled         = (known after apply)

          + type            = (known after apply)
        }
    }


  # aws_s3_bucket.steamhaus-labs-deploy will be created

  + resource "aws_s3_bucket" "steamhaus-labs-deploy" {

      + acceleration_status         = (known after apply)
      + acl                         = "private"

      + arn                         = (known after apply)

      + bucket                      = "steamhaus-env0-test"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)

      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)

          + mfa_delete = (known after apply)
        }
    }

  # aws_security_group.app_alb will be created
  + resource "aws_security_group" "app_alb" {
      + arn                    = (known after apply)

      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)

      + ingress                = (known after apply)
      + name                   = "app-alb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-alb"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ecs"
        }

      + vpc_id                 = (known after apply)
    }

  # aws_security_group.unfiltered_egress will be created
  + resource "aws_security_group" "unfiltered_egress" {
      + arn                    = (known after apply)

      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)

      + name                   = "unfiltered-egress"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "unfiltered-egress"
        }

      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.app_alb_to_ecs will be created
  + resource "aws_security_group_rule" "app_alb_to_ecs" {
      + from_port                = 0

      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # aws_security_group_rule.internet_to_app_alb will be created
  + resource "aws_security_group_rule" "internet_to_app_alb" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"

      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.unfiltered_egress_to_internet will be created
  + resource "aws_security_group_rule" "unfiltered_egress_to_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "fargate-eu-west-1a"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)

      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "fargate-eu-west-1b"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)

      + public_ip            = (known after apply)

      + public_ipv4_pool     = (known after apply)
      + tags                 = {

          + "Environment" = "dev"
          + "Name"        = "fargate-eu-west-1c"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "fargate"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)

      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)

      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "fargate-eu-west-1a"
          + "Terraform"   = "true"
        }
    }


  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)

      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {

          + "Environment" = "dev"
          + "Name"        = "fargate-eu-west-1b"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created

  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)

      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"

          + "Name"        = "fargate-eu-west-1c"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {

      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)

      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)

      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {

          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)

      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)

      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }

    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {

      + destination_cidr_block     = "0.0.0.0/0"

      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)

      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)

      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)

      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)

      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "fargate-private-eu-west-1a"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "fargate-private-eu-west-1b"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "fargate-private-eu-west-1c"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "fargate-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "fargate-private-eu-west-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "fargate-private-eu-west-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "fargate-private-eu-west-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "fargate-public-eu-west-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)

      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "fargate-public-eu-west-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created

  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"

      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.103.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)

      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "dev"

          + "Name"        = "fargate-public-eu-west-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created

  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)

      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)

      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"

      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)

      + tags                             = {
          + "Environment" = "dev"
          + "Name"        = "fargate"
          + "Terraform"   = "true"
        }
    }

Plan: 59 to add, 0 to change, 0 to destroy.


Warning: Quoted references are deprecated

  on helloworld-task.tf line 57, in resource "aws_ecs_service" "helloworld_fargate":
  57:     ignore_changes = ["desired_count"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now

deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

```

</details>

  [Full Plan Logs on env0](https://app.env0.com/p/748f210a-9789-4a9b-a7b9-388a4181ef02/environments/3003e123-de93-419a-b5b8-7db0a08a7a85/deployments/ccdbbc64-6619-480d-83aa-6e3aa7cd8697)
  